DATA:
$I IS NUMBER
$RES IS NUMBER

PROCEDURE:
STORE 10 IN $I
DISPLAY "Vamos a hacer un \GREENDisan Count\NORMAL desde \BLUE"
DISPLAY $I
DISPLAY "\NORMAL hasta \RED0\NORMAL!\n"
WHILE $I IS GREATER THAN 0 DO
    ;Veo si $I es par
    DIVIDE $I BY 2 IN _ REMAINDER IN $RES
    IF $RES IS EQUAL TO 0 THEN
        DISPLAY " 👉 "
        DISPLAY $I
        DISPLAY " es \YELLOWpar\NORMAL!\n"
    END-IF
    ;Le resto 1 a $I
    SUBTRACT 1 FROM $I IN $I
REPEAT
DISPLAY "Listo! 😁\n"
END

